{
  "poems": [
    {
      "id": 1,
      "title": "The Road Not Taken",
      "author": "Robert Frost",
      "country": "us",
      "year": 1916,
      "type": "original",
      "era": "modern",
      "fullText": "Two roads diverged in a yellow wood,\nAnd sorry I could not travel both\nAnd be one traveler, long I stood\nAnd looked down one as far as I could\nTo where it bent in the undergrowth;\n\nThen took the other, as just as fair,\nAnd having perhaps the better claim,\nBecause it was grassy and wanted wear;\nThough as for that the passing there\nHad worn them really about the same,\n\nAnd both that morning equally lay\nIn leaves no step had trodden black.\nOh, I kept the first for another day!\nYet knowing how way leads on to way,\nI doubted if I should ever be back.\n\nI shall be telling this with a sigh\nSomewhere ages and ages hence:\nTwo roads diverged in a wood, and I—\nI took the one less traveled by,\nAnd that has made all the difference.",
      "themes": ["choice", "life", "regret", "individualism"],
      "analysis": "Frost's most famous poem explores the theme of choice and its consequences. The speaker reflects on a moment of decision that shaped their entire life. The poem's enduring popularity stems from its universal theme of wondering about paths not taken.",
      "historicalContext": "Written during a period of personal reflection, this poem has become synonymous with American individualism and the pioneer spirit.",
      "literaryDevices": ["metaphor", "symbolism", "irony", "rhyme scheme"],
      "hasTranslation": true,
      "hasAudio": true,
      "difficulty": "intermediate",
      "readingTime": 2
    },
    {
      "id": 2,
      "title": "Haiku: An Ancient Pond",
      "author": "Matsuo Bashō",
      "country": "jp",
      "year": 1686,
      "type": "translated",
      "era": "classical",
      "fullText": "An ancient pond—\na frog leaps in,\nthe sound of water.",
      "originalText": "古池や\n蛙飛び込む\n水の音",
      "themes": ["nature", "zen", "simplicity", "moment"],
      "analysis": "This haiku captures a single moment in nature, embodying the Zen principle of finding profound meaning in simple observations. The juxtaposition of stillness and sudden movement creates a perfect snapshot of natural harmony.",
      "historicalContext": "Written during Japan's Edo period, this haiku exemplifies the classical form and Bashō's mastery of capturing fleeting moments.",
      "literaryDevices": ["juxtaposition", "imagery", "seasonal reference", "kigo"],
      "hasTranslation": true,
      "hasAudio": true,
      "translator": "R.H. Blyth",
      "difficulty": "beginner",
      "readingTime": 1
    },
    {
      "id": 3,
      "title": "Sonnet 18: Shall I compare thee to a summer's day?",
      "author": "William Shakespeare",
      "country": "uk",
      "year": 1609,
      "type": "original",
      "era": "renaissance",
      "fullText": "Shall I compare thee to a summer's day?\nThou art more lovely and more temperate:\nRough winds do shake the darling buds of May,\nAnd summer's lease hath all too short a date:\nSometime too hot the eye of heaven shines,\nAnd often is his gold complexion dimm'd;\nAnd every fair from fair sometime declines,\nBy chance or nature's changing course, untrimm'd;\nBut thy eternal summer shall not fade,\nNor lose possession of that fair thou owest;\nNor shall Death brag thou wander'st in his shade,\nWhen in eternal lines to time thou growest:\nSo long as men can breathe or eyes can see,\nSo long lives this, and this gives life to thee.",
      "themes": ["love", "beauty", "immortality", "time"],
      "analysis": "Shakespeare's most famous sonnet argues that poetry can preserve beauty forever, making the beloved immortal through verse. The poem moves from comparison to transcendence, claiming that art outlasts nature.",
      "historicalContext": "Part of Shakespeare's sequence of 154 sonnets, likely written in the 1590s during the English Renaissance.",
      "literaryDevices": ["metaphor", "personification", "volta", "iambic pentameter"],
      "hasTranslation": true,
      "hasAudio": true,
      "difficulty": "advanced",
      "readingTime": 3
    },
    {
      "id": 4,
      "title": "Still I Rise",
      "author": "Maya Angelou",
      "country": "us",
      "year": 1978,
      "type": "original",
      "era": "contemporary",
      "fullText": "You may write me down in history\nWith your bitter, twisted lies,\nYou may trod me in the very dirt\nBut still, like dust, I'll rise.\n\nDoes my sassiness upset you?\nWhy are you beset with gloom?\n'Cause I walk like I've got oil wells\nPumping in my living room.\n\nJust like moons and like suns,\nWith the certainty of tides,\nJust like hopes springing high,\nStill I'll rise.\n\nDid you want to see me broken?\nBowed head and lowered eyes?\nShoulders falling down like teardrops,\nWeakened by my soulful cries?\n\nDoes my haughtiness offend you?\nDon't you take it awful hard\n'Cause I laugh like I've got gold mines\nDiggin' in my own backyard.\n\nYou may shoot me with your words,\nYou may cut me with your eyes,\nYou may kill me with your hatefulness,\nBut still, like air, I'll rise.\n\nDoes my sexiness upset you?\nDoes it come as a surprise\nThat I dance like I've got diamonds\nAt the meeting of my thighs?\n\nOut of the huts of history's shame\nI rise\nUp from a past that's rooted in pain\nI rise\nI'm a black ocean, leaping and wide,\nWelling and swelling I bear in the tide.\n\nLeaving behind nights of terror and fear\nI rise\nInto a daybreak that's wondrously clear\nI rise\nBringing the gifts that my ancestors gave,\nI am the dream and the hope of the slave.\nI rise\nI rise\nI rise.",
      "themes": ["resilience", "empowerment", "identity", "overcoming"],
      "analysis": "Angelou's powerful anthem of resilience speaks to the indomitable human spirit. The repetitive 'I rise' becomes a mantra of strength, celebrating the ability to overcome oppression and adversity.",
      "historicalContext": "Written during the Civil Rights era, this poem became an anthem for marginalized communities and continues to inspire movements for equality.",
      "literaryDevices": ["repetition", "metaphor", "rhetorical questions", "imagery"],
      "hasTranslation": true,
      "hasAudio": true,
      "difficulty": "intermediate",
      "readingTime": 4
    },
    {
      "id": 5,
      "title": "The Raven",
      "author": "Edgar Allan Poe",
      "country": "us",
      "year": 1845,
      "type": "original",
      "era": "romantic",
      "fullText": "Once upon a midnight dreary, while I pondered, weak and weary,\nOver many a quaint and curious volume of forgotten lore—\nWhile I nodded, nearly napping, suddenly there came a tapping,\nAs of some one gently rapping, rapping at my chamber door.\n\"'Tis some visitor,\" I muttered, \"tapping at my chamber door—\nOnly this and nothing more.\"\n\nAh, distinctly I remember it was in the bleak December;\nAnd each separate dying ember wrought its ghost upon the floor.\nEagerly I wished the morrow;—vainly I had sought to borrow\nFrom my books surcease of sorrow—sorrow for the lost Lenore—\nFor the rare and radiant maiden whom the angels name Lenore—\nNameless here for evermore.\n\nAnd the silken, sad, uncertain rustling of each purple curtain\nThrilled me—filled me with fantastic terrors never felt before;\nSo that now, to still the beating of my heart, I stood repeating\n\"'Tis some visitor entreating entrance at my chamber door—\nSome late visitor entreating entrance at my chamber door;—\nThis it is and nothing more.\"\n\nPresently my soul grew stronger; hesitating then no longer,\n\"Sir,\" said I, \"or Madam, truly your forgiveness I implore;\nBut the fact is I was napping, and so gently you came rapping,\nAnd so faintly you came tapping, tapping at my chamber door,\nThat I scarce was sure I heard you\"—here I opened wide the door;—\nDarkness there and nothing more.\n\nDeep into that darkness peering, long I stood there wondering, fearing,\nDoubting, dreaming dreams no mortal ever dared to dream before;\nBut the silence was unbroken, and the stillness gave no token,\nAnd the only word there spoken was the whispered word, \"Lenore?\"\nThis I whispered, and an echo murmured back the word, \"Lenore!\"—\nMerely this and nothing more.\n\nBack into the chamber turning, all my soul within me burning,\nSoon again I heard a tapping somewhat louder than before.\n\"Surely,\" said I, \"surely that is something at my window lattice;\nLet me see, then, what thereat is, and this mystery explore—\nLet my heart be still a moment and this mystery explore;—\n'Tis the wind and nothing more!\"\n\nOpen here I flung the shutter, when, with many a flirt and flutter,\nIn there stepped a stately Raven of the saintly days of yore;\nNot the least obeisance made he; not a minute stopped or stayed he;\nBut, with mien of lord or lady, perched above my chamber door—\nPerched upon a bust of Pallas just above my chamber door—\nPerched, and sat, and nothing more.\n\nThen this ebony bird beguiling my sad fancy into smiling,\nBy the grave and stern decorum of the countenance it wore,\n\"Though thy crest be shorn and shaven, thou,\" I said, \"art sure no craven,\nGhastly grim and ancient Raven wandering from the Nightly shore—\nTell me what thy lordly name is on the Night's Plutonian shore!\"\nQuoth the Raven \"Nevermore.\"\n\nMuch I marvelled this ungainly fowl to hear discourse so plainly,\nThough its answer little meaning—little relevancy bore;\nFor we cannot help agreeing that no living human being\nEver yet was blessed with seeing bird above his chamber door—\nBird or beast upon the sculptured bust above his chamber door,\nWith such name as \"Nevermore.\"\n\nBut the Raven, sitting lonely on the placid bust, spoke only\nThat one word, as if his soul in that one word he did outpour.\nNothing farther then he uttered—not a feather then he fluttered—\nTill I scarcely more than muttered \"Other friends have flown before—\nOn the morrow he will leave me, as my Hopes have flown before.\"\nThen the bird said \"Nevermore.\"\n\nStartled at the stillness broken by reply so aptly spoken,\n\"Doubtless,\" said I, \"what it utters is its only stock and store\nCaught from some unhappy master whom unmerciful Disaster\nFollowed fast and followed faster till his songs one burden bore—\nTill the dirges of his Hope that melancholy burden bore\nOf 'Never—nevermore.'\"\n\nBut the Raven still beguiling all my fancy into smiling,\nStraight I wheeled a cushioned seat in front of bird, and bust and door;\nThen, upon the velvet sinking, I betook myself to linking\nFancy unto fancy, thinking what this ominous bird of yore—\nWhat this grim, ungainly, ghastly, gaunt, and ominous bird of yore\nMeant in croaking \"Nevermore.\"\n\nThis I sat engaged in guessing, but no syllable expressing\nTo the fowl whose fiery eyes now burned into my bosom's core;\nThis and more I sat divining, with my head at ease reclining\nOn the cushion's velvet lining that the lamp-light gloated o'er,\nBut whose velvet-violet lining with the lamp-light gloating o'er,\nShe shall press, ah, nevermore!\n\nThen, methought, the air grew denser, perfumed from an unseen censer\nSwung by Seraphim whose foot-falls tinkled on the tufted floor.\n\"Wretch,\" I cried, \"thy God hath lent thee—by these angels he hath sent thee\nRespite—respite and nepenthe from thy memories of Lenore;\nQuaff, oh quaff this kind nepenthe and forget this lost Lenore!\"\nQuoth the Raven \"Nevermore.\"\n\n\"Prophet!\" said I, \"thing of evil!—prophet still, if bird or devil!—\nWhether Tempter sent, or whether tempest tossed thee here ashore,\nDesolate yet all undaunted, on this desert land enchanted—\nOn this home by Horror haunted—tell me truly, I implore—\nIs there—is there balm in Gilead?—tell me—tell me, I implore!\"\nQuoth the Raven \"Nevermore.\"\n\n\"Prophet!\" said I, \"thing of evil!—prophet still, if bird or devil!\nBy that Heaven that bends above us—by that God we both adore—\nTell this soul with sorrow laden if, within the distant Aidenn,\nIt shall clasp a sainted maiden whom the angels name Lenore—\nClasp a rare and radiant maiden whom the angels name Lenore.\"\nQuoth the Raven \"Nevermore.\"\n\n\"Be that word our sign of parting, bird or fiend!\" I shrieked, upstarting—\n\"Get thee back into the tempest and the Night's Plutonian shore!\nLeave no black plume as a token of that lie thy soul hath spoken!\nLeave my loneliness unbroken!—quit the bust above my door!\nTake thy beak from out my heart, and take thy form from off my door!\"\nQuoth the Raven \"Nevermore.\"\n\nAnd the Raven, never flitting, still is sitting, still is sitting\nOn the pallid bust of Pallas just above my chamber door;\nAnd his eyes have all the seeming of a demon's that is dreaming,\nAnd the lamp-light o'er him streaming throws his shadow on the floor;\nAnd my soul from out that shadow that lies floating on the floor\nShall be lifted—nevermore!",
      "themes": ["grief", "loss", "madness", "supernatural"],
      "analysis": "Poe's masterpiece explores the psychology of grief through the narrator's descent into madness. The raven's repetitive 'Nevermore' becomes increasingly torturous as it confirms the narrator's worst fears about loss and despair.",
      "historicalContext": "Published in 1845, this poem made Poe famous and exemplifies American Gothic literature. It reflects the Romantic era's fascination with death and the supernatural.",
      "literaryDevices": ["internal rhyme", "alliteration", "repetition", "symbolism"],
      "hasTranslation": true,
      "hasAudio": true,
      "difficulty": "advanced",
      "readingTime": 8
    }
  ]
}